unobtrusive-degradfully/app/controllers/messages_controller.rb

  def index
    @messages = Message.all
---
SELECT * FROM "messages" ORDER BY created_at DESC

  def create
    @message = Message.create(:author => params[:author], :message => params[:message])
---
INSERT INTO "messages" ("created_at", "author", "updated_at", "message") VALUES('2009-05-27 22:38:40', 'test', '2009-05-27 22:38:40', 'asdf')